app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 1 AND (id NOT NULL)
SELECT "lists".* FROM "lists"
---
  def index
    if user_signed_in?
      @lists = List.where(:user_id => current_user.id)
    else
      @lists = List.all

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @list = List.find(params[:id])

INSERT INTO "lists" ("category_id", "created_at", "desc", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @list = List.new(params[:list])
    @list.user_id = current_user.id

    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @list = List.find(params[:id])